RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sd_host.h
/** The widths of the data bus. */
typedef enum
{
    CY_SD_HOST_BUS_WIDTH_1_BIT              = 0U,  /**< The 1-bit mode data transfer width. */
    CY_SD_HOST_BUS_WIDTH_4_BIT              = 1U,  /**< The 4-bit mode data transfer width. */
    CY_SD_HOST_BUS_WIDTH_8_BIT              = 2U  /**< The 8-bit mode data transfer width. */
} cy_en_sd_host_bus_width_t;

/** The bus speed modes. */
typedef enum
{
    CY_SD_HOST_BUS_SPEED_DEFAULT            = 0U,  /**< Default Speed mode: 3.3V signaling at 25 MHz SDClk. */
    CY_SD_HOST_BUS_SPEED_HIGHSPEED          = 1U,  /**< High Speed mode: 3.3V signaling at 50 MHz SDClk. */
    CY_SD_HOST_BUS_SPEED_SDR12_5            = 2U,  /**< SDR12: UHS-I (1.8V signaling) at 25 MHz SDClk (12.5 MB/sec). */
    CY_SD_HOST_BUS_SPEED_SDR25              = 3U,  /**< SDR25: UHS-I (1.8V signaling) at 50 MHz SDClk (25 MB/sec). */
    CY_SD_HOST_BUS_SPEED_SDR50              = 4U,  /**< SDR50: UHS-I (1.8V signaling) at 100 MHz SDClk (50 MB/sec). */
    CY_SD_HOST_BUS_SPEED_EMMC_LEGACY        = 5U,  /**< Backwards Compatibility with legacy MMC card (26MB/sec max). */
    CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR = 6U,   /**< eMMC High speed SDR (52MB/sec max) */
    CY_SD_HOST_BUS_SPEED_DDR50              = 7U  /**< DDR50: UHS-I (1.8V signaling) at 50 MHz SDClk (50 MB/sec). */
} cy_en_sd_host_bus_speed_mode_t;

/** The SD bus voltage select. */
typedef enum
{
    CY_SD_HOST_IO_VOLT_3_3V                 = 0U,  /**< 3.3V.*/
    CY_SD_HOST_IO_VOLT_1_8V                 = 1U   /**< 1.8V. */
} cy_en_sd_host_io_voltage_t;

/** Erase type. */
typedef enum
{
    CY_SD_HOST_ERASE_ERASE               = 0U,  /**< The ERASE operation.*/
    CY_SD_HOST_ERASE_DISCARD             = 1U,  /**< The DISCARD operation. */
    CY_SD_HOST_ERASE_FULE                = 2U,  /**< The Full User Area Logical Erase (FULE) operation. */
    CY_SD_HOST_ERASE_SECURE              = 3U,  /**< The secure purge according to
                                                * Secure Removal Type in EXT_CSD
                                                * on the erase groups identified by the
                                                * startAddr&endAddr parameters and
                                                * any copies of those erase groups.
                                                */
    CY_SD_HOST_ERASE_SECURE_TRIM_STEP_2  = 4U,  /**< The secure purge operation on
                                                * the write blocks according to
                                                * Secure Removal Type in EXT_CSD
                                                * and copies of those write blocks
                                                * that were previously identified
                                                * using \ref Cy_SD_Host_Erase with
                                                * CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1
                                                */
    CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1  = 5U,  /**< Mark the write blocks, indicated
                                                * by the startAddr&endAddr parameters,
                                                * for secure erase.
                                                */
    CY_SD_HOST_ERASE_TRIM                = 6U   /**< Trim the write blocks identified by
                                                * the startAddr&endAddr parameters. The controller
                                                * can perform the actual erase at convenient time.
                                                */
} cy_en_sd_host_erase_type_t;

/** Card type. */
typedef enum
{
    CY_SD_HOST_SD               = 0U,  /**< The Secure Digital card (SD). */
    CY_SD_HOST_SDIO             = 1U,  /**< The CD Input Output card (SDIO). */
    CY_SD_HOST_EMMC             = 2U,  /**< The Embedded Multimedia card (eMMC). */
    CY_SD_HOST_COMBO            = 3U,  /**< The Combo card (SD + SDIO). */
    CY_SD_HOST_UNUSABLE         = 4U,  /**< The unusable or not supported. */
    CY_SD_HOST_NOT_EMMC         = 5U   /**< The card is not eMMC. */
} cy_en_sd_host_card_type_t;

/** The card capacity type. */
typedef enum
{
    CY_SD_HOST_SDSC             = 0U,   /**< SDSC - Secure Digital Standard Capacity (up to 2 GB). */
    CY_SD_HOST_SDHC             = 1U,   /**< SDHC - Secure Digital High Capacity (up to 32 GB). */
    CY_SD_HOST_EMMC_LESS_2G     = 0U,   /**< The eMMC block addressing for less than 2GB. */
    CY_SD_HOST_EMMC_GREATER_2G  = 1U,   /**< The eMMC block addressing for greater than 2GB. */
    CY_SD_HOST_SDXC             = 2U,   /**< SDXC - Secure Digital Extended Capacity (up to 2 TB). */
    CY_SD_HOST_UNSUPPORTED      = 4U    /**< Not supported. */
}cy_en_sd_host_card_capacity_t;

/** SDHC response types. */
typedef enum
{
    CY_SD_HOST_RESPONSE_NONE    = 0U, /**< No Response. */
    CY_SD_HOST_RESPONSE_LEN_136 = 1U, /**< Response Length 136. */
    CY_SD_HOST_RESPONSE_LEN_48  = 2U, /**< Response Length 48. */
    CY_SD_HOST_RESPONSE_LEN_48B = 3U  /**< Response Length 48. Check Busy after response. */
}cy_en_sd_host_response_type_t;

/** The DMA type enum. */
typedef enum
{
    CY_SD_HOST_DMA_SDMA         = 0U, /**< SDMA mode. */
    CY_SD_HOST_DMA_ADMA2        = 2U, /**< ADMA2 mode. */
    CY_SD_HOST_DMA_ADMA2_ADMA3  = 3U  /**< ADMA2-ADMA3 mode. */
}cy_en_sd_host_dma_type_t;

/** Write Protect type enum. */
typedef enum
{
    CY_SD_HOST_PERMANENT         = 0U, /**< The permanent write protect. */
    CY_SD_HOST_ENABLE_TEMPORARY  = 1U, /**< The temporary write protect. */
    CY_SD_HOST_DISABLE_TEMPORARY = 2U  /**< Clear the temporary write protect. */
} cy_en_sd_host_write_protect_t;

/** \} group_sd_host_enums */

/**
* \addtogroup group_sd_host_data_structures
* \{
*/

/******************************************************************************
 * Structures
 *****************************************************************************/

/** SD Host initialization configuration structure. */
typedef struct
{
    bool                          emmc;             /**< Set to true of eMMC otherwise false. */
    cy_en_sd_host_dma_type_t      dmaType;          /**< Selects the DMA type to be used. */
    bool                          enableLedControl; /**< If true the SD clock controls one IO
                                                     *   used to indicate when the card
                                                     *    is being accessed.
                                                     */
} cy_stc_sd_host_init_config_t;

/** SD/eMMC card configuration structure. */
typedef struct
{
    bool                          lowVoltageSignaling; /**< If true, the host supports the 1.8V signaling. */
    cy_en_sd_host_bus_width_t     busWidth;            /**< The desired bus width. */
    cy_en_sd_host_card_type_t     *cardType;           /**< The card type. */
    uint32_t                      *rca;                /**< The pointer to where to store the cards relative card address. */
    cy_en_sd_host_card_capacity_t *cardCapacity;       /**< Stores the card capacity. */
}cy_stc_sd_host_sd_card_config_t;

/** SD Host command configuration structure. */
typedef struct
{
    uint32_t                      commandIndex;      /**< The index of the command. */
    uint32_t                      commandArgument;   /**< The argument for the command. */
    bool                          enableCrcCheck;    /**< Enables the CRC check on the response. */
    bool                          enableAutoResponseErrorCheck; /**< If true the hardware checks the response for errors. */
    cy_en_sd_host_response_type_t respType;          /**< The response type. */
    bool                          enableIdxCheck;    /**< Checks the index of the response. */
    bool                          dataPresent;       /**< true: Data is present to
                                                      * be transferred using the DAT line,
                                                      * false: Commands use the CMD line only.
                                                      */
    cy_en_sd_host_cmd_type_t      cmdType;           /**< The command type. */
} cy_stc_sd_host_cmd_config_t;

/** The SD Host data transfer configuration structure. */
typedef struct
{
    uint32_t                      blockSize;           /**< The size of the data block. */
    uint32_t                      numberOfBlock;       /**< The number of blocks to send. */
    bool                          enableDma;           /**< Enables DMA for the transaction. */
    cy_en_sd_host_auto_cmd_t      autoCommand;         /**< Selects which auto commands are used if any. */
    bool                          read;                /**< true = Read from the card, false = Write to the card. */
    uint32_t*                     data;                /**< The pointer to data to send/receive or
                                                        *   the pointer to the DMA descriptor.
                                                        */
    uint32_t                      dataTimeout;         /**< The timeout value for the transfer. */
    bool                          enableIntAtBlockGap; /**< Enables the interrupt generation at the block gap. */
    bool                          enReliableWrite;     /**< For EMMC enables the reliable write. */
}cy_stc_sd_host_data_config_t;

