RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sd_host.h
/*******************************************************************************
* Function Name: Cy_SD_Host_EnableSdClk
****************************************************************************//**
*
*  Enables the SD clock (SD host drives the SDCLK line).
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_EnableSdClk(SDHC_Type *base)
{
    /* Check for NULL pointer */
    if (NULL != base)
    {
        SDHC_CORE_CLK_CTRL_R(base) = (uint16_t)((uint32_t)SDHC_CORE_CLK_CTRL_R(base) |
                                                SDHC_CORE_CLK_CTRL_R_SD_CLK_EN_Msk |
                                                SDHC_CORE_CLK_CTRL_R_PLL_ENABLE_Msk);
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_DisableSdClk
****************************************************************************//**
*
*  Disables the SD clock (The SD Host doesn't drive the SDCLK line).
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_DisableSdClk(SDHC_Type *base)
{
    /* Check for NULL pointer */
    if (NULL != base)
    {
        /* Disable SD CLK */
        SDHC_CORE_CLK_CTRL_R(base) = _CLR_SET_FLD16U(SDHC_CORE_CLK_CTRL_R(base),
                                        SDHC_CORE_CLK_CTRL_R_SD_CLK_EN, 0UL);

        /* Wait for at least 3 card clock periods */
        Cy_SysLib_DelayUs(CY_SD_HOST_3_PERIODS_US);

        /* Disable PLL */
        SDHC_CORE_CLK_CTRL_R(base) = _CLR_SET_FLD16U(SDHC_CORE_CLK_CTRL_R(base),
                                        SDHC_CORE_CLK_CTRL_R_PLL_ENABLE, 0UL);
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_BufferRead
****************************************************************************//**
*
*  Reads 32-bits of data from the read buffer.
*  Only use this function if not using SD block DMA to transfer data from buffer.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     Data that is being read.
*
*******************************************************************************/
__STATIC_INLINE uint32_t  Cy_SD_Host_BufferRead(SDHC_Type const *base)
{
    /* Return the Buffer Data Port Register value */
    return SDHC_CORE_BUF_DATA_R(base);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_BufferWrite
****************************************************************************//**
*
*  Writes 32-bits of data into the write buffer.
*  Only use this function if not using SD block DMA to transfer data to buffer.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param data
*     Data to be written.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t  Cy_SD_Host_BufferWrite(SDHC_Type *base, uint32_t data)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        SDHC_CORE_BUF_DATA_R(base) = data;

        ret = CY_SD_HOST_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_StopAtBlockGap
****************************************************************************//**
*
*  Commands SD host to stop transmitting at the next block gap.
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_StopAtBlockGap(SDHC_Type *base)
{
    SDHC_CORE_BGAP_CTRL_R(base) = _CLR_SET_FLD8U(SDHC_CORE_BGAP_CTRL_R(base),
                                            SDHC_CORE_BGAP_CTRL_R_STOP_BG_REQ,
                                            1UL);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_ContinueFromBlockGap
****************************************************************************//**
*
*  Commands SD host to continue transmitting after stopping at the block gap.
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_ContinueFromBlockGap(SDHC_Type *base)
{
    SDHC_CORE_BGAP_CTRL_R(base) = (uint8_t)(((uint32_t)SDHC_CORE_BGAP_CTRL_R(base) &
        ~SDHC_CORE_BGAP_CTRL_R_STOP_BG_REQ_Msk) |  /* Clear the Stop At Block Gap Request bit. */
        SDHC_CORE_BGAP_CTRL_R_CONTINUE_REQ_Msk);   /* Set the Continue Request bit. */
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetAutoCmdErrStatus
****************************************************************************//**
*
*  Gets the SD host error status of the auto command.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The bit mask of the Auto Command status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetAutoCmdErrStatus(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_AUTO_CMD_STAT_R(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_EnableAutoCmd23
****************************************************************************//**
*
*  If the card supports AutoCmd23 call this function to enable it in the host.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return \ref cy_en_sd_host_status_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t  Cy_SD_Host_EnableAutoCmd23(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        SDHC_CORE_XFER_MODE_R(base) = _CLR_SET_FLD16U(SDHC_CORE_XFER_MODE_R(base),
                                      SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE,
                                      2UL);

        ret = CY_SD_HOST_SUCCESS;
    }

    return ret;
}


