RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sd_host.h
/*******************************************************************************
* Function Name: Cy_SD_Host_GetNormalInterruptEnable
****************************************************************************//**
*
*  Returns which normal interrupts are enabled.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The Bit field of which normal interrupt statuses are enabled.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetNormalInterruptEnable(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_NORMAL_INT_STAT_EN_R(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetNormalInterruptMask
****************************************************************************//**
*
*  Setting a bit in this register allows the enabled status to cause an interrupt.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param interruptMask
*     The Bit field of which normal interrupts can cause an interrupt.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_SetNormalInterruptMask(SDHC_Type *base, uint32_t interruptMask)
{
    SDHC_CORE_NORMAL_INT_SIGNAL_EN_R(base) = (uint16_t)interruptMask;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetNormalInterruptMask
****************************************************************************//**
*
*  Returns which normal interrupts are masked to cause an interrupt.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The Bit field of which normal interrupts are masked to cause an interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetNormalInterruptMask(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_NORMAL_INT_SIGNAL_EN_R(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetErrorInterruptStatus
****************************************************************************//**
*
*  Returns the error Int Status register.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The bit mask of the error Int status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptStatus(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_ERROR_INT_STAT_R(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_ClearErrorInterruptStatus
****************************************************************************//**
*
*  Clears the error interrupt status.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param status
*     The bitmask of statuses to clear.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_ClearErrorInterruptStatus(SDHC_Type *base, uint32_t status)
{
    SDHC_CORE_ERROR_INT_STAT_R(base) = (uint16_t)status;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetErrorInterruptEnable
****************************************************************************//**
*
*  Setting a bit in this register allows for the bit to be active in
*  the Int status register.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param interrupt
*     The Bit field of which error interrupt status to enable.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_SetErrorInterruptEnable(SDHC_Type *base, uint32_t interrupt)
{
    SDHC_CORE_ERROR_INT_STAT_EN_R(base) = (uint16_t)interrupt;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetErrorInterruptEnable
****************************************************************************//**
*
*  Returns which error interrupts are enabled.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The Bit field of which error interrupt statuses are enabled.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptEnable(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_ERROR_INT_STAT_EN_R(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SetErrorInterruptMask
****************************************************************************//**
*
* Setting a bit in this register allows the enabled status to cause an interrupt.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param interruptMask
*     The Bit filed of which error interrupts can cause an interrupt.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SD_Host_SetErrorInterruptMask(SDHC_Type *base, uint32_t interruptMask)
{
    SDHC_CORE_ERROR_INT_SIGNAL_EN_R(base) = (uint16_t)interruptMask;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetErrorInterruptMask
****************************************************************************//**
*
*  Returns which error interrupts are masked to cause an interrupt.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The Bit field of which error interrupts are masked to cause an interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptMask(SDHC_Type const *base)
{
    uint32_t ret;

    ret = (uint32_t)SDHC_CORE_ERROR_INT_SIGNAL_EN_R(base);

    return ret;
}

/** \} group_sd_host_interrupt_functions */

#ifdef __cplusplus
}
#endif

/** \} group_sd_host */

#endif /* defined (CY_IP_MXSDHC) */

#endif /* CY_SD_HOST_PDL_H */


/* [] END OF FILE */
